Revit 2026 API

# CurveByPointsSketchPlane Property

---

Override the SketchPlane property of CurveElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override SketchPlane SketchPlane { get; set; }
```
```vb
Public Overrides Property SketchPlane As SketchPlane
	Get
	Set
```
```cpp
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get () override;
	void set (SketchPlane^ value) override;
}
```
```fsharp
abstract SketchPlane : SketchPlane with get, set
override SketchPlane : SketchPlane with get, set
```

#### Property Value

SketchPlane

CurveByPoints has no associated SketchPlane. Getting this property returns . Setting it causes an InvalidOperationException.

#### Reference

CurveByPoints Class

Autodesk.Revit.DB Namespace